<unk>	0
<s>	0
</s>	0
�	-0.238791
▁	-1.87064
,	-3.82612
.	-4.72179
e	-5.80072
s	-6.4482
-	-6.46258
a	-6.52046
i	-6.61507
n	-6.62427
r	-6.62768
u	-6.70524
o	-6.72065
?	-6.72817
t	-6.75164
l	-6.88999
!	-7.04912
m	-7.20315
;	-7.28536
d	-7.34252
c	-7.4289
p	-7.65476
:	-7.74004
1	-7.79337
v	-7.89543
2	-7.95432
)	-8.0307
(	-8.11555
3	-8.1597
[	-8.16423
]	-8.16423
I	-8.33707
h	-8.40107
f	-8.5007
q	-8.5167
0	-8.53296
4	-8.56291
g	-8.64747
b	-8.66228
8	-8.68875
6	-8.87799
X	-8.87799
5	-8.89198
V	-8.91573
9	-8.98541
7	-8.99058
j	-9.08849
z	-9.24264
M	-9.41699
E	-9.67856
x	-9.70998
C	-9.82246
L	-9.82246
A	-9.94921
N	-9.94921
